# 1. Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько
# чисел и строк и сохраните в переменные, выведите на экран.

variable_1 = 894
variable_2 = 0.589
variable_3 = 'Переменная'

variable_4 = input("Введите числовую переменную №1 ('x'): \n")
variable_5 = input("Введите числовую переменную №1 ('x'): \n")

variable_6 = input("Введите строковую переменную №1 : \n")
variable_7 = input("Введите строковую переменную №2 : \n")


print('переменная 1 = ', variable_1)
print('переменная 2 = ', variable_2)
print('переменная 3 = ', variable_3)
print('переменная 4 = ', variable_4)
print('переменная 5 = ', variable_5)
print('переменная 6 = ', variable_6)
print('переменная 7 = ', variable_7)



