"""
. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение. При вызове функции
должен создаваться объект-генератор. Функция должна вызываться следующим образом: for el in fact(n). Функция отвечает
за получение факториала числа, а в цикле необходимо выводить только первые n чисел, начиная с 1! и до n!.
Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
"""

from math import factorial
from itertools import count


def fibo_gen():
    for el in count(1):
        yield factorial(el)


x = 0
try:
    n = int(input("Введите значение числа n: "))
    for i in fibo_gen():
        count
        print('Factorial {} - {}'.format(x + 1, i))
        if x == n-1:
            break
        x += 1
except ValueError:
    print("Некорректное значение!")
